# OMZ compatibility layer
getantidote/use-omz

# OMZ libraries (core shell behaviors)
ohmyzsh/ohmyzsh path:lib/key-bindings.zsh
ohmyzsh/ohmyzsh path:lib/directories.zsh
ohmyzsh/ohmyzsh path:lib/history.zsh
ohmyzsh/ohmyzsh path:lib/completion.zsh
ohmyzsh/ohmyzsh path:lib/theme-and-appearance.zsh

# OMZ plugins
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/sudo
ohmyzsh/ohmyzsh path:plugins/copypath
ohmyzsh/ohmyzsh path:plugins/brew
ohmyzsh/ohmyzsh path:plugins/aliases

# GitHub plugins
matijaoe/pnpm.plugin.zsh
MichaelAquilina/zsh-you-should-use
g-plane/zsh-yarn-autocompletions

# Shell enhancements
Aloxaf/fzf-tab
zsh-users/zsh-history-substring-search

# Syntax highlighting — load last, defer for performance
zdharma-continuum/fast-syntax-highlighting kind:defer
