tap "alienator88/cask"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "macos-fuse-t/cask"
brew "bat"
brew "btop"
brew "coreutils"
brew "deno"
brew "docker"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "go"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "lsusb"
brew "n"
brew "ncdu"
brew "onefetch"
brew "p7zip"
brew "pinentry-mac"
brew "pipx"
brew "powerlevel10k"
brew "ranger"
brew "ripgrep"
brew "thefuck"
brew "tldr"
brew "tor"
brew "tree"
brew "wget"
brew "yt-dlp"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "1password"
cask "1password-cli"
cask "angry-ip-scanner"
cask "appcleaner"
cask "balenaetcher"
cask "bartender"
cask "betterdisplay"
cask "bitwarden"
cask "bluewallet"
cask "boop"
cask "brave-browser"
cask "brave-browser@beta"
cask "calibre"
cask "chatgpt"
cask "coconutbattery"
cask "coteditor"
cask "cryptomator"
cask "dropbox"
cask "electrum"
cask "etrecheckpro"
cask "figma"
cask "firefox@developer-edition"
cask "font-cascadia-code"
cask "font-cascadia-mono"
cask "font-commit-mono"
cask "font-dm-mono"
cask "font-geist"
cask "font-geist-mono"
cask "font-geist-mono-nerd-font"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-inconsolata"
cask "font-inter"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-kode-mono"
cask "font-lato"
cask "font-manrope"
cask "font-martian-mono"
cask "font-monaspace"
cask "font-nunito"
cask "font-open-sans"
cask "font-overpass-mono"
cask "font-oxygen-mono"
cask "font-reddit-mono"
cask "font-reddit-sans"
cask "font-roboto"
cask "font-roboto-flex"
cask "font-roboto-mono"
cask "font-space-mono"
cask "font-ubuntu"
cask "font-ubuntu-condensed"
cask "font-ubuntu-mono"
cask "font-ubuntu-sans"
cask "font-ubuntu-sans-mono"
cask "font-victor-mono"
cask "github"
cask "google-chrome"
cask "google-drive"
cask "httpie"
cask "iina"
cask "iterm2"
cask "keepassxc"
cask "keka"
cask "keyboardcleantool"
cask "knockknock"
cask "latest"
cask "logi-options-plus"
cask "mactracker"
cask "malwarebytes"
cask "marta"
cask "megasync"
cask "micro-snitch"
cask "mullvad-browser"
cask "mullvadvpn"
cask "netnewswire"
cask "nota"
cask "notesnook"
cask "notion"
cask "obsidian"
cask "onyx"
cask "pearcleaner"
cask "postman"
cask "proton-drive"
cask "protonvpn"
cask "qbittorrent"
cask "raycast"
cask "screen-studio"
cask "selfcontrol"
cask "sf-symbols"
cask "sidenotes"
cask "signal"
cask "silicon"
cask "slack"
cask "sparrow"
cask "spotify"
cask "standard-notes"
cask "stats"
cask "syntax-highlight"
cask "telegram"
cask "tor-browser"
cask "tradingview"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "yubico-authenticator"
