tap "alienator88/cask"
tap "antoniorodr/memo"
tap "charmbracelet/tap"
tap "gromgit/brewtils"
tap "homebrew-ffmpeg/ffmpeg"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/services"
tap "macos-fuse-t/cask"
tap "px4/px4"
tap "sandreas/tap"
tap "satococoa/tap"
tap "sst/tap"
tap "valkyrie00/bbrew"
# Simple, modern, secure file encryption
brew "age"
# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Automated text file generator
brew "autogen"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# CLI tool for analyzing Claude Code usage from local JSONL files
brew "ccusage"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# USB programmer
brew "dfu-util"
# Tool for managing dock items
brew "dockutil"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Test various flash cards
brew "f3"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Render markdown on the CLI
brew "glow"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Tool for glamorous shell scripts
brew "gum"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# API Support for your favorite torrent trackers
brew "jackett", restart_service: :changed
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# List USB devices, just like the Linux lsusb command
brew "lsusb"
# Mac App Store command-line interface
brew "mas"
# Modern and intuitive terminal-based text editor
brew "micro"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Create BitTorrent metainfo files
brew "mktorrent"
# Deep clean and optimize your Mac
brew "mole"
# Node version management
brew "n"
# Interactive cheatsheet tool for the command-line
brew "navi"
# NCurses Disk Usage
brew "ncdu"
# Small build system for use with gyp or CMake
brew "ninja"
# Command-line Git information tool
brew "onefetch"
# Development kit for the Java programming language
brew "openjdk"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PNG image optimizing utility
brew "pngquant"
# Prettier daemon
brew "prettierd"
# QR Code generation
brew "qrencode"
# File browser
brew "ranger"
# Pack repository contents into a single AI-friendly file
brew "repomix"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Utility that provides fast incremental file transfer
brew "rsync"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Cross-shell prompt for astronauts
brew "starship"
# Generate scripting interfaces to C/C++ code
brew "swig"
# Tool Command Language
brew "tcl-tk"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Anonymizing overlay network for TCP
brew "tor"
# Lightweight BitTorrent client
brew "transmission-cli"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Command-line interface for Vercel
brew "vercel-cli"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Internet file retriever
brew "wget"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# CLI app to manage your Apple Notes and Apple reminders
brew "antoniorodr/memo/memo"
# Interactive TUI for Homebrew
brew "gromgit/brewtils/taproom"
# Play, record, convert, and stream audio and video
brew "homebrew-ffmpeg/ffmpeg/ffmpeg", args: ["with-fdk-aac"]
# GNU Embedded Toolchain for ARM
brew "px4/px4/gcc-arm-none-eabi-83"
# Worktree Plus - Enhanced worktree management with automated setup and hooks
brew "satococoa/tap/wtp"
# Modern TUI for managing Homebrew packages and casks on macOS and Linux
brew "valkyrie00/bbrew/bbrew"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Network scanner
cask "angry-ip-scanner"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Display management tool
cask "betterdisplay"
# Desktop password and login vault
cask "bitwarden"
# Scriptable scratchpad for developers
cask "boop"
# Web browser focusing on privacy
cask "brave-browser@beta"
# Open source IDE for exploring and testing APIs
cask "bruno"
# E-books management software
cask "calibre"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
# Claude code parallelisation
cask "conductor"
# Plain-text editor for web pages, program source codes and more
cask "coteditor"
# Multi-platform client-side cloud file encryption tool
cask "cryptomator"
# Write, edit, and chat about your code with AI
cask "cursor"
# All-in-one toolbox for developers
cask "devutils"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Find files, folders, or contents in any file
cask "easyfind"
# Utility to finds and fix problems on computer systems
cask "etrecheckpro"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox@developer-edition"
cask "font-cascadia-code"
cask "font-cascadia-mono"
cask "font-commit-mono"
cask "font-dm-mono"
cask "font-geist"
cask "font-geist-mono"
cask "font-geist-mono-nerd-font"
cask "font-google-sans-code"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-inconsolata"
cask "font-inter"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-juliamono"
cask "font-kode-mono"
cask "font-lato"
cask "font-manrope"
cask "font-maple-mono"
cask "font-martian-mono"
cask "font-monaspace"
cask "font-mononoki"
cask "font-nunito"
cask "font-open-sans"
cask "font-overpass-mono"
cask "font-oxygen-mono"
cask "font-reddit-mono"
cask "font-reddit-sans"
cask "font-roboto"
cask "font-roboto-flex"
cask "font-roboto-mono"
cask "font-space-mono"
cask "font-ubuntu"
cask "font-ubuntu-condensed"
cask "font-ubuntu-mono"
cask "font-ubuntu-sans"
cask "font-ubuntu-sans-mono"
cask "font-victor-mono"
# Pre-built GNU bare-metal toolchain for 32-bit Arm processors
cask "gcc-arm-embedded"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty@tip"
# Web browser
cask "google-chrome"
# Tools to protect your emails and files
cask "gpg-suite"
# Chromium-based web browser
cask "helium-browser"
# Free and open-source media player
cask "iina"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Menu bar manager
cask "jordanbaird-ice@beta"
# Password manager app
cask "keepassxc"
# File archiver
cask "keka"
# End-to-end encryption software
cask "keybase"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Utility that shows the latest app updates
cask "latest"
# App to manage software development and track bugs
cask "linear-linear"
# Software for Logitech devices
cask "logi-options+"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# File system integration
cask "macfuse@dev"
# Detailed information on every Apple product ever made
cask "mactracker"
# Monitors and reports any microphone and camera activity
cask "micro-snitch"
# Web browser focused on privacy and on minimizing tracking and fingerprinting
cask "mullvad-browser"
# Free and open-source RSS reader
cask "netnewswire"
# Privacy-focused note taking app
cask "notesnook"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# AI coding agent desktop client
cask "opencode-desktop"
# Replacement for Docker Desktop
cask "orbstack"
# WebKit based web browser
cask "orion"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Client for Proton Drive
cask "proton-drive"
# Client for Proton Mail and Proton Calendar
cask "proton-mail"
# Bridges Proton Mail to email clients supporting IMAP and SMTP protocols
cask "proton-mail-bridge"
# VPN client focusing on security
cask "protonvpn"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Control your tools with a few keystrokes
cask "raycast"
# Block your own access to distracting websites
cask "selfcontrol"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Note-taking application
cask "sidenotes"
# Instant messaging application focusing on security
cask "signal"
# Identify Intel-only apps
cask "silicon-app"
# Team communication and collaboration software
cask "slack"
# Bitcoin wallet application
cask "sparrow"
# Music streaming service
cask "spotify"
# Free, open-source, and completely encrypted notes app
cask "standard-notes"
# Mux and tag mp4 files
cask "subler"
# CSV file editor
cask "table-tool"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Messaging app with a focus on speed and security
cask "telegram"
# SSH client
cask "termius"
# Web browser focusing on security
cask "tor-browser"
# GUI for editing and creating torrent files
cask "torrent-file-editor"
# Charting and social-networking for investment traders
cask "tradingview"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
# Voice-to-text dictation with AI-powered auto-editing
cask "wispr-flow"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Application for generating TOTP and HOTP codes
cask "yubico-authenticator"
mas "1Password for Safari", id: 1569813296
mas "Actions", id: 1586435171
mas "Amphetamine", id: 937984704
mas "Anybox", id: 1593408455
mas "Codepoint", id: 6444068649
mas "Coin Tick", id: 1141688067
mas "Dropover", id: 1355679052
mas "Endel", id: 1346247457
mas "Flighty", id: 1358823008
mas "Image2WebP", id: 6670599252
mas "Lightweight PDF", id: 1450640351
mas "Magic Disk Benchmark", id: 1608793370
mas "Numbers", id: 361304891
mas "Pages", id: 409201541
mas "Pandan", id: 1569600264
mas "Perplexity", id: 6714467650
mas "Plain Text Editor", id: 1572202501
mas "Reeder", id: 6475002485
mas "Shareful", id: 1522267256
mas "Speediness", id: 1596706466
mas "Speedtest", id: 1153157709
mas "Streaks", id: 963034692
mas "Strongbox", id: 897283731
mas "TestFlight", id: 899247664
mas "Whisper Transcription", id: 1668083311
mas "Wipr", id: 1320666476
mas "Xcode", id: 497799835
vscode "afzalsayed96.icones"
vscode "albert.tabout"
vscode "amirha.better-comments-2"
vscode "antfu.file-nesting"
vscode "antfu.goto-alias"
vscode "antfu.iconify"
vscode "antfu.icons-carbon"
vscode "antfu.open-in-github-button"
vscode "antfu.slidev"
vscode "antfu.smart-clicks"
vscode "antfu.theme-vitesse"
vscode "antfu.unocss"
vscode "antfu.where-am-i"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "anysphere.remote-containers"
vscode "arcanis.vscode-zipfs"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "astro-build.astro-vscode"
vscode "attilabuti.vscode-mjml"
vscode "be5invis.toml"
vscode "bobj2018.status"
vscode "bocovo.dbml-erd-visualizer"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "cdonohue.quill-icons"
vscode "cpylua.language-postcss"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-open-in-github"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "gencer.html-slim-scss-css-class-completion"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "humao.rest-client"
vscode "idered.npm"
vscode "jakewilson.vscode-placeholder-images"
vscode "jbockle.jbockle-format-files"
vscode "jkjustjoshing.vscode-text-pastry"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "lokalise.i18n-ally"
vscode "mariusalchimavicius.json-to-ts"
vscode "matijao.matijao-theme-vitesse"
vscode "matijao.modern-js-snippets"
vscode "matijao.vue-nuxt-snippets"
vscode "michelemelluso.gitignore"
vscode "miguelsolorio.fluent-icons"
vscode "miguelsolorio.symbols"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "mushan.vscode-paste-image"
vscode "mvllow.rose-pine"
vscode "mylesmurphy.prettify-ts"
vscode "naumovs.color-highlight"
vscode "nuxt.mdc"
vscode "nuxtr.nuxtr-vscode"
vscode "openai.chatgpt"
vscode "orsenkucher.vscode-graphql"
vscode "oven.bun-vscode"
vscode "oxc.oxc-vscode"
vscode "patbenatar.advanced-new-file"
vscode "peterschmalfeldt.explorer-exclude"
vscode "pflannery.vscode-versionlens"
vscode "philsinatra.nested-comments"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "qezhu.gitlink"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "raunofreiberg.vesper"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.liveserver"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sleistner.vscode-fileutils"
vscode "sst-dev.opencode"
vscode "stivo.tailwind-fold"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-croatian"
vscode "streetsidesoftware.code-spell-checker-german"
vscode "svelte.svelte-vscode"
vscode "syler.sass-indented"
vscode "tauri-apps.tauri-vscode"
vscode "techer.open-in-browser"
vscode "tobermory.es6-string-html"
vscode "tobiaswaelde.material-colors"
vscode "tomrijndorp.find-it-faster"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "vivaxy.vscode-conventional-commits"
vscode "vue.volar"
vscode "vunguyentuan.vscode-css-variables"
vscode "wakatime.vscode-wakatime"
vscode "wmaurer.change-case"
vscode "yatki.vscode-surround"
vscode "yoavbls.pretty-ts-errors"
vscode "zainchen.json"
vscode "zamerick.vscode-caddyfile-syntax"
vscode "zengxingxin.sort-js-object-keys"
vscode "zignd.html-css-class-completion"
go "golang.org/x/tools/gopls"
go "github.com/Picocrypt/CLI/picocrypt"
go "honnef.co/go/tools/cmd/staticcheck"
